
Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Запрос = Неопределено;
	
	ПозицияСловаПоместить = СтрНайти(ВРег(ТекстЗапроса), "ПОМЕСТИТЬ ");
	
	ИмяИсточникаДанных = ЗарплатаКадрыОбщиеНаборыДанных.ПервоеСловоНачинаяСПозицииВТексте(ТекстЗапроса, ПозицияСловаПоместить + СтрДлина("ПОМЕСТИТЬ "));
	МассивПодстрокИмениИсточникаДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяИсточникаДанных, "_");
	ИмяВременнойТаблицы = МассивПодстрокИмениИсточникаДанных[0];
	ИмяПредставления = МассивПодстрокИмениИсточникаДанных[1];
	Если МассивПодстрокИмениИсточникаДанных.Количество() > 2 Тогда
		ИмяПараметра = МассивПодстрокИмениИсточникаДанных[2];
	Иначе
		ИмяПараметра = Неопределено;
	КонецЕсли;
	
	МассивИменВТИсточниковПараметров = ЗарплатаКадрыОбщиеНаборыДанных.МассивИменВТИсточниковПараметров(ТекстЗапроса, ИмяИсточникаДанных);
	ПараметрыЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыЗапроса(ТекстЗапроса, ИмяИсточникаДанных);
	
	ПредставлениеТолькоРазрешенные = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ТолькоРазрешенные", ПараметрыЗапроса);
	ТолькоРазрешенные = ВРег(ПредставлениеТолькоРазрешенные) = "ИСТИНА";

	Если ВРег(ИмяПредставления) = ВРег("ПодчиненностьПодразделений1234") 
		Или ВРег(ИмяПредставления) = ВРег("ПодчиненностьПодразделенийОрганизаций1234") Тогда
		
		Подразделения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Подразделения", ПараметрыЗапроса);
		
		Если МассивИменВТИсточниковПараметров.Количество() > 0  Тогда
			ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Иначе
			ИмяВТИсточникДанных = "";
		КонецЕсли;                                 
		
		КоллекцияПолей = ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		Запрос = амг_ОрганизационнаяСтруктура.ЗапросПредставленияПодчиненностьПодразделений1234(ТолькоРазрешенные, Подразделения, КоллекцияПолей, ИмяИсточникаДанных, ИмяВТИсточникДанных, ПараметрыЗапроса);
		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции
